Project/Toir/src/DataProcessors/торо_РабочееМестоДиспетчера/торо_РабочееМестоДиспетчера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>торо_РабочееМестоДиспетчера</name>
</mdclass:DataProcessor>

Project/Toir/src/Enums/торо_ВидыДокументовСогласованияРемонтов/торо_ВидыДокументовСогласованияРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВидыДокументовСогласованияРемонтов</name>
  <enumValues>
    <name>торо_ВыявленныеДефекты</name>
  </enumValues>
  <enumValues>
    <name>торо_АктОВыполненииЭтапаРабот</name>
  </enumValues>
  <enumValues>
    <name>торо_ПланГрафикРемонта</name>
  </enumValues>
  <enumValues>
    <name>торо_ЗаявкаНаРемонт</name>
  </enumValues>
  <enumValues>
    <name>торо_НарядНаВыполнениеРемонтныхРабот</name>
  </enumValues>
  <enumValues>
    <name>торо_ВнешнееОснованиеДляРабот</name>
  </enumValues>
  <enumValues>
    <name>торо_АктПриемкиОборудования</name>
  </enumValues>
  <enumValues>
    <name>торо_ОстановочныеРемонты</name>
  </enumValues>
  <enumValues>
    <name>торо_ПланРаботПодразделения</name>
  </enumValues>
  <enumValues>
    <name>гкс_ЕВОБланк</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Documents/торо_СостоянияОбъектовРемонта/торо_СостоянияОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_СостоянияОбъектовРемонта</name>
  <basedOn>Document.торо_ВыявленныеДефекты</basedOn>
  <basedOn>Document.торо_АктОВыполненииЭтапаРабот</basedOn>
  <basedOn>Document.торо_АктОВыполненииРегламентногоМероприятия</basedOn>
  <registerRecords>InformationRegister.торо_ТекущееСостояниеОР</registerRecords>
  <registerRecords>AccumulationRegister.торо_КоличествоПусковОР</registerRecords>
  <registerRecords>AccumulationRegister.торо_ВремяПростояОборудования</registerRecords>
  <registerRecords>AccumulationRegister.торо_ВремяНахожденияВСостоянии</registerRecords>
  <registerRecords>AccumulationRegister.торо_ОстановленноеОборудование</registerRecords>
  <registerRecords>AccumulationRegister.торо_ОборудованиеНаИспытаниях</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.торо_ВидыОперацийОтклоненияВРаботеОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_УчетКонтролируемыхПоказателей</types>
      <types>DocumentRef.торо_НарядНаВыполнениеРемонтныхРабот</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
      <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЭксплуатации</name>
    <type>
      <types>CatalogRef.торо_ВидыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзМобильного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ПричинаСоздания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъектыРемонта</name>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаПростоя</name>
      <type>
        <types>CatalogRef.торо_ПричиныПростояОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзменятьСостояниеПодчиненныхОР</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЭксплуатации</name>
      <type>
        <types>CatalogRef.торо_ВидыЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПуска</name>
      <type>
        <types>CatalogRef.торо_ВидыПусковОР</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЭксплуатацииНаПериод</name>
      <type>
        <types>CatalogRef.торо_ВидыЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПускаНаПериод</name>
      <type>
        <types>CatalogRef.торо_ВидыПусковОР</types>
      </type>
    </attributes>
    <attributes>
      <name>Иерархия</name>
      <comment>Предназначен для определения иерархии для структуры которой будет распространятся наработка.</comment>
      <type>
        <types>CatalogRef.торо_СтруктурыОР</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийОР</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/Catalogs/торо_ТиповыеДефектыОборудования/торо_ТиповыеДефектыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ТиповыеДефектыОборудования</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.торо_НаправленияОбъектовРемонтныхРабот</owners>
  <attributes>
    <name>ВидДефекта</name>
    <type>
      <types>CatalogRef.торо_ВидыДефектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КритичностьДефекта</name>
    <type>
      <types>CatalogRef.торо_КритичностьДефекта</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДефекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследствиеДефекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеНаУстранение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПричиныВозникновенияДефекта</name>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.торо_ПричиныДефектов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Catalogs/торо_НаправленияОбъектовРемонтныхРабот/торо_НаправленияОбъектовРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_НаправленияОбъектовРемонтныхРабот</name>
  <predefined>
    <items>
      <name>БезНаправления</name>
      <description>Без направления</description>
    </items>
  </predefined>
  <attributes>
    <name>НаборСвойствОР</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Составное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Кодировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Служба</name>
    <type>
      <types>EnumRef.гкс_Службы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Направление</name>
      <type>
        <types>CatalogRef.торо_НаправленияОбъектовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <comment>Организации</comment>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/DataProcessors/торо_РабочееМестоДиспетчера/Forms/Форма/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьРеквизитыШапкиПоУмолчанию();

	ТипПоиска = "Наименование";
	
	ТекСтруктураИерархии = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ОсновнаяСтруктураИерархии",
	Истина);
	
	Инициатор = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ОсновнойИнициаторДефекта",
	Неопределено);
	
	ИерархияДляВводаНовыхОР = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
	ИспользоватьКартинкиТОР = Константы.торо_ИспользоватьКартинкиТиповыхОбъектов.Получить();
		
	Если НЕ ЗначениеЗаполнено(ТекСтруктураИерархии) Тогда
		ТекСтруктураИерархии = ИерархияДляВводаНовыхОР;
	КонецЕсли;
	
	ОбработатьИзменениеИерархииНаСервере();
	
	ПравоИнтерактивнаяПометкаУдаления = ПравоДоступа("ИнтерактивнаяПометкаУдаления", Метаданные.Справочники.торо_ОбъектыРемонта);
	ПравоИнтерактивноеДобавление = ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Справочники.торо_ОбъектыРемонта);
	ПравоРедактирование = ПравоДоступа("Редактирование", Метаданные.Справочники.торо_ОбъектыРемонта);
	
	ФОУчетСостоянияОборудования 	 = ПолучитьФункциональнуюОпцию("торо_УчетСостоянияОборудования");
	ФОНапоминатьЗафиксироватьПростой = ПолучитьФункциональнуюОпцию("торо_НапоминатьЗафиксироватьПростой");
	
	Если ИспользоватьКартинкиТОР Тогда 
		Элементы.Дерево.ПутьКДаннымКартинкиСтроки = "Дерево.КартинкаОтображаемая";
	Иначе 
		Элементы.Дерево.ПутьКДаннымКартинкиСтроки = "Дерево.Картинка";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененаПометкаУдаленияОР" Тогда
		торо_РаботаСИерархией20Клиент.ОбработкаОповещенияОбИзмененииПометкиУдаленияОбъектаРемонта(ЭтаФорма, Параметр);
		Если ИспользоватьКартинкиТОР Тогда
			ОбновитьКартинкиЭлементовДереваНаСервере();
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ЗаписанОбъектРемонта" Тогда
		торо_РаботаСИерархией20Клиент.ОбработкаОповещенияОЗаписиОбъектаРемонта(ЭтаФорма, Параметр);
		Если ИспользоватьКартинкиТОР Тогда
			ОбновитьКартинкиЭлементовДереваНаСервере();
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ИзмененПорядокОбъектаРемонта" Тогда
		Если Параметр.СтруктураИерархии = ТекСтруктураИерархии Тогда
			торо_НастройкаПорядкаЭлементовКлиент.ИзменитьПорядокЭлементаВДереве(ЭтаФорма, Параметр);
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ИзмененаСтруктураИерархииОР" Тогда
		Если Параметр = Неопределено ИЛИ Параметр = ТекСтруктураИерархии Тогда
			торо_РаботаСИерархией20Клиент.ОбновитьДеревоИерархии(ЭтаФорма);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора <> Неопределено Тогда
		ТиповойДефект = ВыбранноеЗначение.Дефект;
		ВидДефекта = ВыбранноеЗначение.ВидДефекта;
		КритичностьДефекта = ВыбранноеЗначение.КритичностьДефекта;
		ПричинаДефекта = ВыбранноеЗначение.ПричинаДефекта;
		ОписаниеДефекта = ВыбранноеЗначение.ДефектОписание;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область Поиск

&НаКлиенте
Процедура ТипПоискаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> ТипПоиска Тогда
		ОтменитьПоискВПискеОР();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоискаПриИзменении(Элемент)
	ВыполнитьПоискВСпискеОР(ЗначениеПоиска);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоискаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Ожидание > 0 Тогда
		ВыполнитьПоискВСпискеОР(Текст);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоискаОчистка(Элемент, СтандартнаяОбработка)
	ОтменитьПоискВПискеОР();	
КонецПроцедуры

&НаКлиенте
Процедура ТипПоискаПриИзменении(Элемент)
	ВыполнитьПоискВСпискеОР(ЗначениеПоиска);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоискаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ЗначениеПоиска = Текст;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ТиповойДефектПриИзменении(Элемент)
	
	ЗаполнитьПоТИповомуДефекту();
	
КонецПроцедуры

&НаКлиенте
Процедура ТиповойДефектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура("Владелец", ?(ЗначениеЗаполнено(Направление), Направление, ПолучитьПредопределенноеНаправлениеОР())) ;
	ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбора);
	ОткрытьФорму("Справочник.торо_ТиповыеДефектыОборудования.ФормаВыбора",ПараметрыФормы,Элемент,,ВариантОткрытияОкна.ОтдельноеОкно,,Неопределено,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);						
	
КонецПроцедуры

&НаКлиенте
Процедура ТиповойДефектСоздание(Элемент, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("Владелец", ?(ЗначениеЗаполнено(Направление), Направление, ПолучитьПредопределенноеНаправлениеОР())));
	ОткрытьФорму("Справочник.торо_ТиповыеДефектыОборудования.Форма.ФормаЭлемента", ПараметрыФормы, ЭтотОбъект);
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПричинаДефектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	Если ЗначениеЗаполнено(ТиповойДефект) Тогда 
		СписокПричин = ПолучитьСписокПричинДефектовНаСервере(ТиповойДефект); 
		Если СписокПричин.Количество() >0 Тогда 
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура ("Отбор", Новый Структура ("СписокПричин", СписокПричин));
			ОткрытьФорму("Справочник.торо_ПричиныДефектов.ФормаВыбора", ПараметрыФормы, Элемент, ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПричинаДефектаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
		Если ЗначениеЗаполнено(ТиповойДефект) Тогда 
		СтандартнаяОбработка = Ложь;
		СписокПричин = ПолучитьСписокПричинДефектовНаСервере(ТиповойДефект);
		Если СписокПричин.Количество() >0 Тогда
			ПараметрыПолученияДанных.Отбор.Вставить("Ссылка", СписокПричин);
			ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.торо_ПричиныДефектов"), ПараметрыПолученияДанных);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПричинаДефектаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
		Если ЗначениеЗаполнено(ТиповойДефект) Тогда 
		СтандартнаяОбработка = Ложь;
		СписокПричин = ПолучитьСписокПричинДефектовНаСервере(ТиповойДефект);
		Если СписокПричин.Количество() >0 Тогда
			ПараметрыПолученияДанных.Отбор.Вставить("Ссылка", СписокПричин);
			ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.торо_ПричиныДефектов"), ПараметрыПолученияДанных);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтказавшийЭлементОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		струк = ЗаполнитьДанныеОРНаСервере(ВыбранноеЗначение);
		Направление = струк.Направление;
	Иначе
		Направление = ПредопределенноеЗначение("Справочник.торо_НаправленияОбъектовРемонтныхРабот.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДерево

&НаКлиенте
Процедура ДеревоПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Дерево.ТекущиеДанные;
	ЗаполнитьДанныеОРНаКлиенте(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПередНачаломИзменения(Элемент, Отказ)
	
	торо_РаботаСИерархией20Клиент.ПередНачаломИзменения(Элемент, Отказ, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени(ПредопределенноеЗначение("Справочник.КлючевыеОперации.торо_ОткрытиеФормыОбъектовРемонта"),,Истина);
	
	СтандартнаяОбработка = Ложь;
	торо_РаботаСИерархией20Клиент.ПередНачаломИзменения(Элемент, Ложь, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПередРазворачиванием(Элемент, Строка, Отказ)
	
	торо_РаботаСИерархией20Клиент.ДеревоПередРазворачиванием(Дерево, Строка, СтруктураПараметровИерархии);
	Если ИспользоватьКартинкиТОР Тогда
		ОбновитьКартинкиЭлементовДереваНаСервере(Строка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени(ПредопределенноеЗначение("Справочник.КлючевыеОперации.торо_ОткрытиеФормыОбъектовРемонта"),,Истина);
	
	СтандартнаяОбработка = Ложь;
	Если Не Элементы.Список.ТекущиеДанные = Неопределено Тогда
		ПоказатьЗначение(Неопределено, Элементы.Список.ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	ЗаполнитьДанныеОРНаКлиенте(ТекущиеДанные);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ИспользоватьКартинкиТОР = Константы.торо_ИспользоватьКартинкиТиповыхОбъектов.Получить();
	торо_РаботаСИерархией20.СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки, ИспользоватьКартинкиТОР);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗарегистрироватьДефект(Команда)
	
	Если ПроверитьЗаполнениеОбязательныхРеквизитов() Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.СтраницыГруппаЛевая.ТекущаяСтраница = Элементы.ГруппаДерево Тогда
	    ТекДанные = Элементы.Дерево.ТекущиеДанные;
		Если ТипЗнч(ТекДанные.Ссылка) = Тип("СправочникСсылка.торо_СтруктурыОР") Тогда
		    ТекстСообщения = НСтр("ru = 'В качестве объекта ремонта нельзя выбрать вид иерархии объектов ремонта.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
	Иначе
	    ТекДанные = Элементы.Список.ТекущиеДанные;
	КонецЕсли; 
	
	Если ТекДанные.ЭтоГруппа = Истина Тогда
	    ТекстСообщения = НСтр("ru = 'В качестве объекта ремонта нельзя выбрать группу.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;	
	
	Результат = СоздатьДокументВыявленныйДефект();
	Если ЗначениеЗаполнено(Результат) тогда
		Номер = Результат;
		Статус = "Зарегистрирован";
		
		Если ФОНапоминатьЗафиксироватьПростой И ФОУчетСостоянияОборудования Тогда
		    ПоказатьВопрос(Новый ОписаниеОповещения("ЗарегистрироватьДефектЗавершение", ЭтотОбъект, Неопределено), НСтр("ru = 'Зафиксировать фактический простой объектов?'"), РежимДиалогаВопрос.ДаНет);
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьДефектЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
	
		МассивОР = Новый Массив;
		МассивОР.Добавить(ОбъектРемонта);
		
		ЗначенияЗаполнения = Новый Структура();
		ЗначенияЗаполнения.Вставить("ДокументОснование", НовыйДок);
		ЗначенияЗаполнения.Вставить("МассивОР", МассивОР);
		ЗначенияЗаполнения.Вставить("СтруктураИерархии", ТекСтруктураИерархии);
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения, СтруктураИерархии", ЗначенияЗаполнения, ТекСтруктураИерархии);
		ОткрытьФорму("Документ.торо_СостоянияОбъектовРемонта.ФормаОбъекта", ПараметрыФормы, ЭтаФорма, НовыйДок);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьОбработку(Команда)
	
	ОчиститьПоля();
		
КонецПроцедуры

&НаКлиенте
Процедура ДефектнаяВедомость(Команда)
	Если ЗначениеЗаполнено(НовыйДок) Тогда
		МассивПараметровКоманды = Новый Массив;
		МассивПараметровКоманды.Добавить(НовыйДок);
		
		торо_Печать.НапечататьДокумент("Документ.торо_ВыявленныеДефекты",
		"ДефектнаяВедомость",
		МассивПараметровКоманды);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЖурналДефектов(Команда)
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("НачПериода", НачалоГода(Дата));
	ПараметрыОтбора.Вставить("КонПериода", КонецГода(Дата));
	ПараметрыОтбора.Вставить("ПодразделениеДляДок", ПодразделениеДляДок);
	ПараметрыОтбора.Вставить("Организация", Организация);
	ПараметрыОтбора.Вставить("ОР", ТекущийОР);
	
	допПараметры = Новый Структура();
	допПараметры.Вставить("ПараметрыОтбора", ПараметрыОтбора);

	ОткрытьФорму("Документ.торо_ВыявленныеДефекты.Форма.ФормаЖурналаДефектов", допПараметры);
КонецПроцедуры

&НаКлиенте
Процедура АктДефектации(Команда)
	
	Если не ЗначениеЗаполнено(НовыйДок) Тогда
		возврат;
	КонецЕсли;
	
	ДефектыОборудования = ПолучитьСтруктуруПараметровКоманды_АктДефектации(НовыйДок);
	
	Если ДефектыОборудования.Количество() = 1 Тогда
		СтруктураПараметровКоманды = Новый Структура("Док, ID", НовыйДок, ДефектыОборудования[0].ID);
		МассивПараметровКоманды = Новый Массив();
		МассивПараметровКоманды.Добавить(НовыйДок);
		
		торо_Печать.НапечататьДокумент("Документ.торо_ВыявленныеДефекты",
		"АктДефектации",
		МассивПараметровКоманды, СтруктураПараметровКоманды);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДефектнаяВедомостьЛиквидацияОР(Команда)
	Если не ЗначениеЗаполнено(НовыйДок) Тогда
		Возврат;
	КонецЕсли;
	
	МассивПараметровКоманды = Новый Массив;
	МассивПараметровКоманды.Добавить(НовыйДок);
	
	торо_Печать.НапечататьДокумент("Документ.торо_ВыявленныеДефекты",
	"ДефектнаяВедомостьЛиквидация",
	МассивПараметровКоманды);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Оповещение о закрытии, вызывается при выполнении команды "Настройка иерархии".
&НаКлиенте
Процедура НастройкаИерархииЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		ТекСтруктураИерархии = ВыбранноеЗначение.СтруктураИерархии;
		ОбработатьИзменениеИерархииНаСервере();
		торо_РаботаСИерархией20Клиент.ОбработатьИзменениеИерархииНаКлиенте(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеИерархииНаСервере()
	
	торо_РаботаСИерархией20.ЗаполнитьПараметрыИерархии(ЭтаФорма);
	СтруктураПараметровИерархии.КонечныеЭлементыВДереве = Истина;
	ПустойРодитель = торо_РаботаСИерархией20.ПустойРодительПоСтруктуреИерархии(СтруктураПараметровИерархии);
	торо_РаботаСИерархией20.УстановитьЗапросВСпискеПоИерархии(Список, СтруктураПараметровИерархии, ПустойРодитель);
	торо_РаботаСИерархией20КлиентСервер.УстановитьОтборСпискаПоРодителю(Список, ПустойРодитель, Ложь);
	торо_РаботаСИерархией20КлиентСервер.НачатьЗаполнениеДереваИерархии(Дерево, СтруктураПараметровИерархии, ПустойРодитель);
	
	Если ИспользоватьКартинкиТОР Тогда
		ОбновитьКартинкиЭлементовДереваНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеОРНаКлиенте(ТекущиеДанные)

	Если ТекущиеДанные <> Неопределено Тогда
		
		ТекущийОР = ТекущиеДанные.Ссылка;
		стрВозврата = ЗаполнитьДанныеОРНаСервере(ТекущийОР);
		
		ВходитВСостав = торо_РаботаСИерархией20.ПолучитьТекущегоРодителяВИерархии(ТекущийОР, ТекСтруктураИерархии);
		
		Если стрВозврата.Контрагент <> Неопределено И ЗначениеЗаполнено(стрВозврата.Контрагент) Тогда
			Элементы.Подразделение.Видимость = Ложь;
			Элементы.Контрагент.Видимость = Истина;
		Иначе
			Элементы.Подразделение.Видимость = Истина;
			Элементы.Контрагент.Видимость = Ложь;
		КонецЕсли;
		
		Подразделение = стрВозврата.Подразделение;
		Наименование = стрВозврата.Наименование;
		ОбъектРемонта = стрВозврата.Ссылка;
		Местонахождение = стрВозврата.АдресМестонахождения;
		ИнвентарныйНомер = стрВозврата.ИнвентарныйНомер;
		ЗаводскойНомер = стрВозврата.ЗаводскойНомер;
		ТехнологичейскийНомер = стрВозврата.ТехНомер;
		ПодразделениеИсполнитель = стрВозврата.ПодразделениеИсполнитель;
		Контрагент = стрВозврата.Контрагент;
		Направление = стрВозврата.Направление;
		
		Если стрВозврата.ЭтоГруппа <> Неопределено И стрВозврата.ЭтоГруппа = Ложь Тогда
			ОтказавшийЭлемент = ТекущиеДанные.Ссылка;
		Иначе
			ОтказавшийЭлемент = Неопределено;
		КонецЕсли;
		
		Дата = ТекущаяДата();
		ДатаОбнаружения = ТекущаяДата();
		
		КонтактноеЛицо = Неопределено;
		ТиповойДефект = Неопределено;
		КритичностьДефекта = Неопределено;
		ОписаниеДефекта = Неопределено;
		ВидДефекта = Неопределено;
		ПричинаДефекта = Неопределено;
		УсловияВыявленияДефекта = Неопределено;
		
		Статус = "";
		Номер = "";
		НовыйДок = Неопределено;
	Иначе 
		Статус = "";
		Номер = "";
		НовыйДок = Неопределено;
	КонецЕсли;
	
КонецПроцедуры
	
&НаСервереБезКонтекста
Функция ЗаполнитьДанныеОРНаСервере(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ОбъектыРемонта.ИнвентарныйНомер КАК ИнвентарныйНомер,
	               |	торо_ОбъектыРемонта.ЗаводскойНомер КАК ЗаводскойНомер,
	               |	торо_ОбъектыРемонта.ТехНомер КАК ТехНомер,
	               |	торо_ОбъектыРемонта.АдресМестонахождения КАК АдресМестонахождения,
	               |	торо_ОбъектыРемонта.Наименование КАК Наименование,
	               |	торо_ОбъектыРемонта.Подразделение КАК Подразделение,
	               |	торо_ОбъектыРемонта.ПодразделениеИсполнитель КАК ПодразделениеИсполнитель,
	               |	торо_ОбъектыРемонта.Направление КАК Направление,
	               |	торо_ОбъектыРемонта.ЭтоГруппа КАК ЭтоГруппа,
	               |	торо_ОбъектыРемонта.ВнешнийОбъект КАК ВнешнийОбъект,
	               |	торо_ОбъектыРемонта.Контрагент КАК Контрагент,
				   |	торо_ОбъектыРемонта.Ссылка
	               |ИЗ
	               |	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	               |ГДЕ
	               |	торо_ОбъектыРемонта.Ссылка = &Ссылка";
				   
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	стрВозврата = Новый Структура("ИнвентарныйНомер,ЗаводскойНомер,ТехНомер,АдресМестонахождения,Наименование,Подразделение,ПодразделениеИсполнитель,Направление,ЭтоГруппа,ВнешнийОбъект,Контрагент,Ссылка");
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат стрВозврата;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(стрВозврата, Выборка);
	возврат стрВозврата;
	
КонецФункции

&НаСервере 
Процедура ЗаполнитьПоТИповомуДефекту()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ТиповыеДефектыОборудованияПричиныВозникновенияДефекта.Причина КАК Причина,
	|	торо_ТиповыеДефектыОборудования.ВидДефекта КАК ВидДефекта,
	|	торо_ТиповыеДефектыОборудования.КритичностьДефекта КАК КритичностьДефекта,
	|	торо_ТиповыеДефектыОборудования.ОписаниеДефекта КАК ОписаниеДефекта,
	|	торо_ТиповыеДефектыОборудования.НаправлениеНаУстранение КАК НаправлениеНаУстранение,
	|	торо_ТиповыеДефектыОборудования.ПоследствиеДефекта КАК ПоследствиеДефекта
	|ИЗ
	|	Справочник.торо_ТиповыеДефектыОборудования КАК торо_ТиповыеДефектыОборудования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеДефектыОборудования.ПричиныВозникновенияДефекта КАК торо_ТиповыеДефектыОборудованияПричиныВозникновенияДефекта
	|		ПО (торо_ТиповыеДефектыОборудованияПричиныВозникновенияДефекта.Ссылка = торо_ТиповыеДефектыОборудования.Ссылка)
	|ГДЕ
	|	торо_ТиповыеДефектыОборудования.Ссылка = &Ссылка";
				   
	Запрос.УстановитьПараметр("Ссылка", ТиповойДефект);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда возврат; КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	ВидДефекта = Выборка.ВидДефекта;
	ПричинаДефекта = Выборка.Причина;
	КритичностьДефекта = Выборка.КритичностьДефекта;
	ОписаниеДефекта = Выборка.ОписаниеДефекта;
	ПоследствиеДефекта = Выборка.ПоследствиеДефекта;
	НаправлениеНаУстранение = Выборка.НаправлениеНаУстранение;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыШапкиПоУмолчанию()
	
	Организация = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиТОиР",
		"ОсновнаяОрганизация",
		Справочники.Организации.ПустаяСсылка());
		
	ПодразделениеДляДок = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиТОиР",
		"ОсновноеПодразделение",
		Справочники.СтруктураПредприятия.ПустаяСсылка());
		
	Дата = ТекущаяДата();
	ДатаОбнаружения = ТекущаяДата();
		
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеОбязательныхРеквизитов()
	
	Ошибка = Ложь;
	
	масОшибок = Новый Массив;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Ошибка = Истина;
		масОшибок.Добавить("Организация");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПодразделениеДляДок) Тогда
		Ошибка = Истина;
		масОшибок.Добавить("Подразделение");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(УсловияВыявленияДефекта) Тогда
		Ошибка = Истина;
		масОшибок.Добавить("Дефект выявлен в процессе");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Ошибка = Истина;
		масОшибок.Добавить("Дата");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаОбнаружения) Тогда
		Ошибка = Истина;
		масОшибок.Добавить("Дата обнаружения");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОтказавшийЭлемент) Тогда
		Ошибка = Истина;
		масОшибок.Добавить("Отказавший элемент");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВидДефекта) Тогда
		Ошибка = Истина;
		масОшибок.Добавить("Вид дефекта");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПричинаДефекта) Тогда
		Ошибка = Истина;
		масОшибок.Добавить("Причина дефекта");
	КонецЕсли;
	
	Для каждого текСтрока из масОшибок Цикл
		ШаблонСообщения = НСтр("ru = 'Поле <%1> не заполнено! Документ не будет создан.'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекСтрока);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЦикла;
	
	Возврат Ошибка;
	
КонецФункции

&НаСервере 
Функция СоздатьДокументВыявленныйДефект()
	
	Если ЗначениеЗаполнено(Номер) и Документы.торо_ВыявленныеДефекты.НайтиПоНомеру(Номер, Дата) <> Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Документ с таким номером уже существует в этом периоде! Документ не был создан.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
	
	ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ВыявленныеДефекты;
	СогласованиеИспользуется = торо_РаботаССогласованиями.ПроверитьИспользованиеСогласованияДокументов(ВидДокумента);

	СтруктураЗаполнения = Новый Структура;
	СтруктураЗаполнения.Вставить("Дата", Дата);
	СтруктураЗаполнения.Вставить("ДатаОбнаружения", ДатаОбнаружения);
	Если ЗначениеЗаполнено(Номер) Тогда 
		СтруктураЗаполнения.Вставить("Номер", Номер);
	КонецЕсли;
	
	СтруктураЗаполнения.Вставить("Инициатор", Инициатор);
	СтруктураЗаполнения.Вставить("КонтактноеЛицоИнициатора", КонтактноеЛицо);
	СтруктураЗаполнения.Вставить("ДефектВыявленВПроцессе", УсловияВыявленияДефекта);
	СтруктураЗаполнения.Вставить("Организация", Организация);
	СтруктураЗаполнения.Вставить("Подразделение", ПодразделениеДляДок);
	СтруктураЗаполнения.Вставить("ОбъектРемонта", ОбъектРемонта);
	СтруктураЗаполнения.Вставить("ПодразделениеИсполнитель", ПодразделениеИсполнитель);
		
	СтруктураСтрокиТЧ = Новый Структура;
	СтруктураСтрокиТЧ.Вставить("ОтказавшийЭлемент", ОтказавшийЭлемент);
	СтруктураСтрокиТЧ.Вставить("ОбъектРемонта", ОбъектРемонта);
	СтруктураСтрокиТЧ.Вставить("ТиповойДефект", ТиповойДефект);
	СтруктураСтрокиТЧ.Вставить("ВидДефекта", ВидДефекта);
	СтруктураСтрокиТЧ.Вставить("ДефектПричина", ПричинаДефекта);
	СтруктураСтрокиТЧ.Вставить("КритичностьДефекта", КритичностьДефекта);
	СтруктураСтрокиТЧ.Вставить("ДефектОписание", ОписаниеДефекта);
	СтруктураСтрокиТЧ.Вставить("ПоследствияДефекта", ПоследствиеДефекта);
	СтруктураСтрокиТЧ.Вставить("НаправлениеНаУстранение", НаправлениеНаУстранение);
	СтруктураСтрокиТЧ.Вставить("ПодразделениеИсполнитель", ПодразделениеИсполнитель);
	
	МассивСтрокТЧ = Новый Массив;
	МассивСтрокТЧ.Добавить(СтруктураСтрокиТЧ);
	
	СтруктураЗаполнения.Вставить("МассивСтрокТЧ", МассивСтрокТЧ);
	
	докОбъект = Документы.торо_ВыявленныеДефекты.СоздатьДокумент();
	докОбъект.Заполнить(СтруктураЗаполнения);
	
	Попытка
		Если СогласованиеИспользуется Тогда
			докОбъект.Записать(РежимЗаписиДокумента.Запись);
		Иначе 
			докОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	Исключение
		ТекстСообщения = НСтр("ru = 'При записи документа произошла ошибка: '") + ОписаниеОшибки();
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		возврат Неопределено;
	КонецПопытки;
	
	НовыйДок = докОбъект.Ссылка;
	Возврат докОбъект.Номер;	
	
КонецФункции

&НаКлиенте
Процедура ОчиститьПоля()
	
	НовыйДок = Неопределено;	
	
	Дата = ТекущаяДата();
	ДатаОбнаружения = ТекущаяДата();
	
	ПодразделениеИсполнитель = ПолучитьПодразделениеИсполнительОРНаСервере(ОтказавшийЭлемент);
	//Инициатор = Неопределено;
	КонтактноеЛицо = Неопределено; 
	ТиповойДефект = Неопределено;
	КритичностьДефекта = Неопределено;
	ВидДефекта = Неопределено;
	ПричинаДефекта = Неопределено;
	УсловияВыявленияДефекта = Неопределено;
	ОписаниеДефекта = "";
	
	Статус = "";
	Номер = "";
	
	ЗаполнитьРеквизитыШапкиПоУмолчанию();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПодразделениеИсполнительОРНаСервере(ОтказавшийЭлемент)
	
	Если НЕ ОтказавшийЭлемент.Пустая() Тогда
		Возврат ОтказавшийЭлемент.ПодразделениеИсполнитель;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции 

Функция ПолучитьСтруктуруПараметровКоманды_АктДефектации(ДокДефект)
	
	ДефектыОборудования = Новый Массив;
	
	Для каждого Стр Из ДокДефект.СписокДефектов Цикл
		СтруктураТЧ = Новый Структура("ID, ОбъектРемонта");
		ЗаполнитьЗначенияСвойств(СтруктураТЧ, Стр);
		ДефектыОборудования.Добавить(СтруктураТЧ);
	КонецЦикла;
	
	Возврат ДефектыОборудования;	
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокПричинДефектовНаСервере(ТиповойДефект)
	
	Причины = Новый СписокЗначений;  
	Для каждого Стр Из ТиповойДефект.ПричиныВозникновенияДефекта Цикл
		Причины.Добавить(Стр.Причина);	
	КонецЦикла;
	
	Возврат Причины;
	
КонецФункции

&НаСервере
Функция ПолучитьПредопределенноеНаправлениеОР()
	Возврат Справочники.торо_НаправленияОбъектовРемонтныхРабот.Безнаправления;
КонецФункции

&НаКлиенте
Процедура ВыполнитьПоискВСпискеОР(Текст)
	
	Если СтрДлина(Текст) = 0 Тогда
		ОтменитьПоискВПискеОР();
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипПоиска) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, ТипПоиска, Текст, ВидСравненияКомпоновкиДанных.Содержит,,Истина);
	КонецЕсли;
	
	Элементы.СтраницыГруппаЛевая.ТекущаяСтраница = Элементы.ГруппаТаблицаПоиска;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПоискВПискеОР()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, ТипПоиска, "", ВидСравненияКомпоновкиДанных.Содержит,,Ложь);
	Элементы.СтраницыГруппаЛевая.ТекущаяСтраница = Элементы.ГруппаДерево;
	
КонецПроцедуры

&НаСервере 
Процедура ОбновитьКартинкиЭлементовДереваНаСервере(ИдентификаторСтроки = 0)
	торо_РаботаСИерархией20.ОбновитьКартинкиЭлементовДереваНаСервере(Дерево, ИдентификаторСтроки);
КонецПроцедуры
#КонецОбласти
